contiki-os/contiki/cc26xxware/inc/hw_spis.h
// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM0                                              0x00000800

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM1                                              0x00000804

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM2                                              0x00000808

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM3                                              0x0000080C

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM4                                              0x00000810

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM5                                              0x00000814

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM6                                              0x00000818

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM7                                              0x0000081C

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM8                                              0x00000820

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM9                                              0x00000824

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM10                                             0x00000828

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM11                                             0x0000082C

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM12                                             0x00000830

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM13                                             0x00000834

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM14                                             0x00000838

// SPI Slave RX FIFO Data
#define SPIS_O_RXFMEM15                                             0x0000083C

//*****************************************************************************
//
// Register: SPIS_O_GPFLAGS
//
//*****************************************************************************
// Field: [3]    BYTE_DONE
//
// 0
#define SPIS_GPFLAGS_BYTE_DONE                                      0x00000008
#define SPIS_GPFLAGS_BYTE_DONE_BITN                                 3
#define SPIS_GPFLAGS_BYTE_DONE_M                                    0x00000008
#define SPIS_GPFLAGS_BYTE_DONE_S                                    3

// Field: [2]    BYTE_RX_OVF
//
// Parallel receive data overflow event.
//
// 0: No overflow condition is detected.
// 1: An overflow condition of sampled SDI pin data is detected. The SPI Slave
// is able to buffer one byte of data sampled on the SDI pin.
//
#define SPIS_GPFLAGS_BYTE_RX_OVF                                    0x00000004
#define SPIS_GPFLAGS_BYTE_RX_OVF_BITN                               2
#define SPIS_GPFLAGS_BYTE_RX_OVF_M                                  0x00000004
#define SPIS_GPFLAGS_BYTE_RX_OVF_S                                  2

// Field: [1]    BYTE_ABORT
//
// Incomplete SPI transfer event.
//
// 0: No SPI incomplete transfer detected.
// 1: Chip select has been de-asserted during a byte transfer.
//
#define SPIS_GPFLAGS_BYTE_ABORT                                     0x00000002
#define SPIS_GPFLAGS_BYTE_ABORT_BITN                                1
#define SPIS_GPFLAGS_BYTE_ABORT_M                                   0x00000002
#define SPIS_GPFLAGS_BYTE_ABORT_S                                   1

// Field: [0]    CS
//
// Chip select event.
//
// 0: Chip select has not been asserted.
// 1: Chip select assertion is detected.
//
#define SPIS_GPFLAGS_CS                                             0x00000001
#define SPIS_GPFLAGS_CS_BITN                                        0
#define SPIS_GPFLAGS_CS_M                                           0x00000001
#define SPIS_GPFLAGS_CS_S                                           0

//*****************************************************************************
//
// Register: SPIS_O_GPFLAGSSET
//
//*****************************************************************************
// Field: [3]    BYTE_DONE
//
// 0: No effect.
// 1: Set GPFLAGS.BYTE_DONE high
#define SPIS_GPFLAGSSET_BYTE_DONE                                   0x00000008
#define SPIS_GPFLAGSSET_BYTE_DONE_BITN                              3
#define SPIS_GPFLAGSSET_BYTE_DONE_M                                 0x00000008
#define SPIS_GPFLAGSSET_BYTE_DONE_S                                 3

// Field: [2]    BYTE_RX_OVF
//
// 0: No effect.
// 1: Set GPFLAGS.BYTE_RX_OVF high
#define SPIS_GPFLAGSSET_BYTE_RX_OVF                                 0x00000004
#define SPIS_GPFLAGSSET_BYTE_RX_OVF_BITN                            2
#define SPIS_GPFLAGSSET_BYTE_RX_OVF_M                               0x00000004
#define SPIS_GPFLAGSSET_BYTE_RX_OVF_S                               2

// Field: [1]    BYTE_ABORT
//
// 0: No effect.
// 1: Set GPFLAGS.BYTE_ABORT high
#define SPIS_GPFLAGSSET_BYTE_ABORT                                  0x00000002
#define SPIS_GPFLAGSSET_BYTE_ABORT_BITN                             1
#define SPIS_GPFLAGSSET_BYTE_ABORT_M                                0x00000002
#define SPIS_GPFLAGSSET_BYTE_ABORT_S                                1

// Field: [0]    CS
//
// 0: No effect.
// 1: Set GPFLAGS.CS high
#define SPIS_GPFLAGSSET_CS                                          0x00000001
#define SPIS_GPFLAGSSET_CS_BITN                                     0
#define SPIS_GPFLAGSSET_CS_M                                        0x00000001
#define SPIS_GPFLAGSSET_CS_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_GPFLAGSMASK
//
//*****************************************************************************
// Field: [5]    RX_DMA_DONE
//
// Enable bit for DMA done, DMA channel with RX FIFO as source.
//
// 0: Not an event source.
// 1: Enabled as an event source.
#define SPIS_GPFLAGSMASK_RX_DMA_DONE                                0x00000020
#define SPIS_GPFLAGSMASK_RX_DMA_DONE_BITN                           5
#define SPIS_GPFLAGSMASK_RX_DMA_DONE_M                              0x00000020
#define SPIS_GPFLAGSMASK_RX_DMA_DONE_S                              5

// Field: [4]    TX_DMA_DONE
//
// 0
#define SPIS_GPFLAGSMASK_TX_DMA_DONE                                0x00000010
#define SPIS_GPFLAGSMASK_TX_DMA_DONE_BITN                           4
#define SPIS_GPFLAGSMASK_TX_DMA_DONE_M                              0x00000010
#define SPIS_GPFLAGSMASK_TX_DMA_DONE_S                              4

