contiki-os/contiki/cc26xxware/inc/hw_spis.h
//*****************************************************************************
//
// Register: SPIS_O_RXFMEM6
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM6_DATA_M                                         0x000000FF
#define SPIS_RXFMEM6_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM7
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM7_DATA_M                                         0x000000FF
#define SPIS_RXFMEM7_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM8
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM8_DATA_M                                         0x000000FF
#define SPIS_RXFMEM8_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM9
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM9_DATA_M                                         0x000000FF
#define SPIS_RXFMEM9_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM10
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM10_DATA_M                                        0x000000FF
#define SPIS_RXFMEM10_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM11
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM11_DATA_M                                        0x000000FF
#define SPIS_RXFMEM11_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM12
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM12_DATA_M                                        0x000000FF
#define SPIS_RXFMEM12_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM13
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM13_DATA_M                                        0x000000FF
#define SPIS_RXFMEM13_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM14
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM14_DATA_M                                        0x000000FF
#define SPIS_RXFMEM14_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM15
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM15_DATA_M                                        0x000000FF
#define SPIS_RXFMEM15_DATA_S                                        0

#endif // __HW_SPIS_H__
